In [1]:
import numpy as np
import pandas as pd

In [2]:
np.nan

nan

In [4]:
pd.NA

In [7]:
df=pd.read_csv('movie_scores.csv')

In [13]:
df.head()

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

# finding the null values

In [10]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [11]:
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [15]:
# Finding the rows which not have null value in pre_movie_score
df[df['pre_movie_score'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [21]:
# finding the rows using multiple filtering or we can say conditional filtering
# like the row which dose not contain multiple null values
df[(df['pre_movie_score'].isnull()) & (df['last_name'].notnull())]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

In [22]:
# Operations with the missing data
# Keep The Data
# Drop The Data
# Fill The Data

In [23]:
# Keep The Data
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [34]:
# Drop The Data
a=df.dropna(thresh=1)
print("This will drop those rows which dont have atleast one value : ")
print(a)
a=df.dropna(thresh=2)
print("This will drop those rows which dont have atleast 2 value: ")
print(a)
a=df.dropna(thresh=3)
print("This will drop those rows which dont have atleast 3 value: ")
print(a)
a=df.dropna(thresh=4)
print("This will drop those rows which dont have atleast 4 value: ")
print(a)
a=df.dropna(thresh=5)
print("This will drop those rows which dont have atleast 5 value: ")
print(a)
a=df.dropna(thresh=None)
print("This will drop all those rows which have any null value  : ")
print(a)

This will drop those rows which dont have atleast one value :
  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0
This will drop those rows which dont have atleast 2 value:
  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0
This will drop those rows which dont have atleast 3 value:
  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0
This will drop those rows which dont have atleast 4 value:
  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0
This will drop those rows which dont have atleast 5 value:
  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0
This will drop all those rows which have any null value  :
  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [36]:
# this will drop all those columns which contain null values
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [39]:
# If we want to drop any row using desired column name 
df.dropna(subset=['last_name'])

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [41]:
# Filling data
df.fillna('Not a Number')

,first_name,last_name,age,sex,pre_movie_score,post_movie_score
0,Tom,Hanks,63.0,m,8.0,10.0
1,Not a Number,Not a Number,Not a Number,Not a Number,Not a Number,Not a Number
2,Hugh,Jackman,51.0,m,Not a Number,Not a Number
3,Oprah,Winfrey,66.0,f,6.0,8.0
4,Emma,Stone,31.0,f,7.0,9.0

In [42]:
df['pre_movie_score'].mean()

7.0

In [47]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean())

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [49]:
df['pre_movie_score'].fillna(df.mean())

C:\Users\HP\AppData\Local\Temp/ipykernel_5568/1456641248.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df['pre_movie_score'].fillna(df.mean())

0    8.0
1    NaN
2    NaN
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [50]:
air_line={'First':100, 'bussines':np.nan, 'Economi':50, 'last':25}

In [51]:
ser=pd.Series(air_line)

In [52]:
ser

First       100.0
bussines      NaN
Economi      50.0
last         25.0
dtype: float64

In [53]:
ser.interpolate()

First       100.0
bussines     75.0
Economi      50.0
last         25.0
dtype: float64

In [54]:
df.interpolate()

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m         8.000000         10.000000
1        NaN       NaN  57.0  NaN         7.333333          9.333333
2       Hugh   Jackman  51.0    m         6.666667          8.666667
3      Oprah   Winfrey  66.0    f         6.000000          8.000000
4       Emma     Stone  31.0    f         7.000000          9.000000